DataProcessors/БуферСканирования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<DataProcessor>
		<Properties>
			<Name>БуферСканирования</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/БуферСканирования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>БуферСканирования</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Счетчик</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>УчитыватьВОстатках</Name>
					<Comment>Уменьшать отображение остатков товаров на складах </Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПриходнаяНакладная</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Серия</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДлинаРучногоШК</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

AccumulationRegisters/ОстаткиТовара.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<AccumulationRegister>
		<Properties>
			<Name>ОстаткиТовара</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Остаток</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>14</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Резерв</Name>
					<Comment>(удалить)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>14</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Партия</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партии</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Фирма</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Фирмы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Catalogs/Партии.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>Партии</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Номенклатура</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Серия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокГодности</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Док</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Фирма</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Фирмы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦенаЗакупки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПартии</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Консигнация</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВКД_ЦенаСоСкидкой</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦенаЗакупкиВБазВалюте</Name>
					<Comment>в долларах</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>19</v8:Digits>
							<v8:FractionDigits>5</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

DataProcessors/БуферСканирования/Forms/Форма/Ext/Form/Module.bsl
#Область СобытияФормы
	
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Пользователь = гоПользователь();
	
	Если Параметры.Свойство("ДокументОснование") Тогда
		ДокументОснование = Параметры.ДокументОснование;   
		Попытка
		    Если ДокументОснование.Окончательно Тогда
				Отказ = Истина;
			КонецЕсли;
		Исключение
		КонецПопытки;
	КонецЕсли;

	ОбновитьТаблицы();
	
	ЭлементОтбора = БуферСерии.КомпоновщикНастроек.ФиксированныеНастройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ИдентификаторПользовательскойНастройки = "Пользователь";
	ЭлементОтбора.ЛевоеЗначение 	= Новый ПолеКомпоновкиДанных("Пользователь");
	ЭлементОтбора.ВидСравнения 		= ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение 	= Пользователь;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ) 

	Заголовок = НСтр("ru = 'Буфер сканирования'; en = 'Scan buffer'");
	УстановитьДоступностьЭлементов();    
	БуферНоменклатураПриАктивизацииСтроки(Элементы.БуферНоменклатура);
	
КонецПроцедуры

&НаКлиенте
Процедура ВнешнееСобытие(Источник, Событие, Данные)
	
	Если НЕ (ЭтаФорма.Окно = АктивноеОкно()) Тогда Возврат КонецЕсли; 
	
	ШК = "";
	Если РаботаСоСканеромШК.СканерШКНачатьОбработку(Источник, Событие, Данные, ШК) Тогда  
		ДобавитьСерию(ШК);
		РаботаСоСканеромШК.СканерШКЗавершитьОбработку();
	КонецЕсли;   
	
КонецПроцедуры
  
&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора) ///Событие формы
	
	//Если ВыбранноеЗначение = Неопределено Тогда
	//	Возврат;
	//КонецЕсли;
	//
	//ДокументОснование = ВыбранноеЗначение; ///Выбранное значение, вернет ссылку (документа)
	//ЗаполнитьПоДокументуНаСервере();

КонецПроцедуры

#КонецОбласти


#Область СобытияЭлементовФормы

&НаКлиенте
Процедура РучнойШКПриИзменении(Элемент)

	ДобавитьСерию(РучнойШК, Истина);

КонецПроцедуры

&НаКлиенте
Процедура БуферНоменклатураПриАктивизацииСтроки(Элемент)     
	
	Если Элемент.ТекущиеДанные = Неопределено Тогда 
		Номенклатура = ПредопределенноеЗначение("Справочник.Номенклатура.ПустаяСсылка");
	Иначе	
		Номенклатура = Элемент.ТекущиеДанные.Номенклатура;
	КонецЕсли;
	
	Заголовок = НСтр("ru = 'Буфер сканирования: '; en = 'Scan buffer: '") + Номенклатура;
	// установим отбор для ДС серий     
	ЭлементОтбораНоменклатура = Неопределено;
	Для каждого ЭлементОтбора Из БуферСерии.КомпоновщикНастроек.ФиксированныеНастройки.Отбор.Элементы Цикл
		Если ЭлементОтбора.ИдентификаторПользовательскойНастройки = "Номенклатура" Тогда
			ЭлементОтбораНоменклатура = ЭлементОтбора;
			Прервать;	
		КонецЕсли;
	КонецЦикла;
	Если ЭлементОтбораНоменклатура = Неопределено Тогда
		ЭлементОтбораНоменклатура = БуферСерии.КомпоновщикНастроек.ФиксированныеНастройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбораНоменклатура.ИдентификаторПользовательскойНастройки = "Номенклатура";
		ЭлементОтбораНоменклатура.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Номенклатура");
		ЭлементОтбораНоменклатура.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	КонецЕсли;
	ЭлементОтбораНоменклатура.ПравоеЗначение = Номенклатура;
	
	УстановитьДоступностьЭлементов();
	
КонецПроцедуры

&НаКлиенте
Процедура ДокументОснованиеПриИзменении(Элемент)

	ОбновитьТаблицы();
	
КонецПроцедуры

&НаКлиенте
Процедура ДокументОснованиеОчистка(Элемент, СтандартнаяОбработка)

	ОбновитьТаблицы();

КонецПроцедуры

&НаКлиенте
Процедура ОтображатьПоследнихСерийПриИзменении(Элемент)
	
	//	БуферСерии.ТекстЗапроса = СтрЗаменить(БуферСерии.ТекстЗапроса, "9999", ОтображатьПоследниеСерии);

КонецПроцедуры

#КонецОбласти


#Область Служебные

&НаСервере
Процедура ОбновитьТаблицы()

	БуферНоменклатура.Параметры.УстановитьЗначениеПараметра("ДокументОснование", ДокументОснование);
	БуферНоменклатура.Параметры.УстановитьЗначениеПараметра("Пользователь", Пользователь);
	БуферНоменклатура.Параметры.УстановитьЗначениеПараметра("ПустаяСерия", "");
	БуферСерии.Параметры.УстановитьЗначениеПараметра("ДокументОснование", ДокументОснование);

КонецПроцедуры

&НаКлиенте
Процедура УстановитьДоступностьЭлементов()
	
	Элементы.РучнойШК.Доступность = ЗначениеЗаполнено(Номенклатура);  
	//Элементы.ПеренестиВДокумент.Доступность = ЗначениеЗаполнено(ДокументНазначение);
	ОбновитьСчетчик();
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьСерию(НоваяСерия, СтатьНаРучной = Ложь)

	ШК = СокрЛП(НоваяСерия);
	Если ШК = "" Тогда Возврат КонецЕсли; 
	
	Ошибки = Новый СписокЗначений;

	ТекДанные = Элементы.буферНоменклатура.ТекущиеДанные;
	Если ТекДанные.ВДокументе <= ТекДанные.Отсканировано + ТекДанные.ОтсканированоДругимиПользователями Тогда
		Ош = СтрШаблон("%1 %2 %3!<br>",
		               омСервер.Фрмт(НСтр("ru = 'Номенклатура'; en = 'Good'"), "НАДПИСЬ_ЦВ1"),
					   омСервер.Фрмт(ТекДанные.Номенклатура, "КРАСНЫЙ_ТЕКСТ"),
					   омСервер.Фрмт(НСтр("ru = 'отсканирована полностью'; en = 'fully scanned'"), "НАДПИСЬ_ЦВ1") 
						); 
		Если Ошибки.НайтиПоЗначению(Ош) = Неопределено Тогда
			Ошибки.Добавить(Ош);
		КонецЕсли;						
	КонецЕсли; 
	
	ПроверитьСериюНаСервере(ШК, Ошибки);
	
	Если Ошибки.Количество() = 0 Тогда
		КлючЗаписи = 1;
		//++
		текСтрокаНоменклатура = элементы.буферноменклатура.ТекущаяСтрока;
		//--
		ДобавитьСериюНаСервере(ШК, КлючЗаписи);	
		//++
		элементы.буферноменклатура.ТекущаяСтрока = текСтрокаНоменклатура;
		//--
		ЭтаФорма.ТекущийЭлемент = Элементы.БуферСерии;
		//Элементы.БуферСерии.ТекущаяСтрока = ШК;  
		 Элементы.БуферСерии.ТекущаяСтрока = КлючЗаписи; 
		ОповеститьОбИзменении(Тип("РегистрСведенийКлючЗаписи.БуферСканирования"));
	Иначе 
		ТекстОшибки = "";
		Для каждого ош Из Ошибки Цикл                                      
			ТекстОшибки = ТекстОшибки + ош.Значение + "<br>";
			//ТекстОшибки = ТекстОшибки + омСервер.Фрмт(); 
		КонецЦикла;  
		клОшибка(Новый ФорматированнаяСтрока(ОбщегоНазначенияСервер.ТекстHTMLВФорматированнуюСтроку(ТекстОшибки)), , 
				"Ошибка буфера сканирования", , НСтр("ru = 'Не гони, уважаемый! Ошибка буфера сканирования'; en = 'Dont bullshit me, hon! Scan buffer error'"), 4); 
	КонецЕсли;
	
	Если СтатьНаРучной Тогда 
		РучнойШК = "";
		ПодключитьОбработчикОжидания("МоеОжидание", 0.1, Истина);
	КонецЕсли;
	
КонецПроцедуры	

&НаСервере
Процедура ПроверитьСериюНаСервере(НоваяСерия, СписокОшибок)
	
	// в буфере
	Запр = Новый Запрос;
	Запр.УстановитьПараметр("Серия", НоваяСерия);
	Запр.Текст = "ВЫБРАТЬ
	             |	БуферСканирования.Серия,
	             |	БуферСканирования.Пользователь,
	             |	БуферСканирования.ДокументОснование,
	             |	БуферСканирования.Номенклатура
	             |ИЗ
	             |	РегистрСведений.БуферСканирования КАК БуферСканирования
	             |ГДЕ
	             |	БуферСканирования.Серия = &Серия"; 
	Выборка = Запр.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		СписокОшибок.Добавить(СтрШаблон("%1 %2 %3<br>%4 %5<br>%6 %7<br>%8 %9", 
										омСервер.Фрмт(НСтр("ru = 'Серия'; en = 'The'"), "НАДПИСЬ_ЦВ1"),
										омСервер.Фрмт(НоваяСерия, "КРАСНЫЙ_ТЕКСТ"),
										омСервер.Фрмт(НСтр("ru = 'уже была отсканирована в буфер:'; en = 'series has already been scanned into the buffer:'"), "НАДПИСЬ_ЦВ1"),
										омСервер.Фрмт(НСтр("ru = 'номенклатура'; en = 'good'"), "НАДПИСЬ_ЦВ1"),
                                        омСервер.Фрмт(Выборка.Номенклатура, "НАДПИСЬ_ЦВ2"),
										омСервер.Фрмт(НСтр("ru = 'пользователь'; en = 'user'"), "НАДПИСЬ_ЦВ1"),
										омСервер.Фрмт(Выборка.Пользователь, "НАДПИСЬ_ЦВ2"),
										омСервер.Фрмт(НСтр("ru = 'документ'; en = 'document'"), "НАДПИСЬ_ЦВ1"),
										омСервер.Фрмт(Выборка.ДокументОснование, "НАДПИСЬ_ЦВ2")) );
	КонецЦикла; 
	
	// на остатках
	Запр = Новый Запрос;
	Запр.УстановитьПараметр("Серия", НоваяСерия);
	Запр.Текст = "ВЫБРАТЬ
	               |	ОстаткиТовараОстатки.ОстатокОстаток,
	               |	ОстаткиТовараОстатки.РезервОстаток,
	               |	ОстаткиТовараОстатки.Партия.Серия
	               |ИЗ
	               |	РегистрНакопления.ОстаткиТовара.Остатки(, Партия.Серия = &Серия) КАК ОстаткиТовараОстатки
	               |ГДЕ
	               |	(ОстаткиТовараОстатки.ОстатокОстаток > 0
	               |			ИЛИ ОстаткиТовараОстатки.РезервОстаток > 0)";
	Запр.УстановитьПараметр("Серия", НоваяСерия);
	Выборка = Запр.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		СписокОшибок.Добавить(СтрШаблон("%1 %2 %3",
		                               	омСервер.Фрмт(НСтр("ru = 'Серия'; en = 'Series'"), "НАДПИСЬ_ЦВ1"),
										омСервер.Фрмт(НоваяСерия, "КРАСНЫЙ_ТЕКСТ"),   
										омСервер.Фрмт(НСтр("ru = 'найдена на складах!'; en = 'found in warehouses!'"), "НАДПИСЬ_ЦВ1")));
	КонецЕсли;	

КонецПроцедуры

&НаСервере
Процедура ДобавитьСериюНаСервере(НоваяСерия, КлючЗаписи = Неопределено)
	
	Счетчик = Счетчик + 1;
	МенеджерЗаписи = РегистрыСведений.БуферСканирования.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.ДокументОснование 	= ДокументОснование;
	МенеджерЗаписи.Пользователь 		= Пользователь;
	МенеджерЗаписи.Номенклатура 		= Номенклатура;
	МенеджерЗаписи.Серия 				= НоваяСерия; 
	МенеджерЗаписи.Счетчик 				= Счетчик; 
	МенеджерЗаписи.Записать();
	
	Элементы.БуферНоменклатура.Обновить();
	
	Если КлючЗаписи <> Неопределено Тогда
		Отбор = Новый Структура;
		Отбор.Вставить("ДокументОснование", ДокументОснование);
		Отбор.Вставить("Пользователь", Пользователь);
		Отбор.Вставить("Номенклатура", Номенклатура);
		Отбор.Вставить("Серия", НоваяСерия);
		Рег = РегистрыСведений.БуферСканирования;
		КлючЗаписи = Рег.СоздатьКлючЗаписи(Отбор);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура МоеОжидание()
	
	ЭтаФорма.ТекущийЭлемент = Элементы.РучнойШК;

КонецПроцедуры

&НаСервере
Процедура ОбновитьСчетчик()

	Запр = Новый Запрос; 
	Запр.УстановитьПараметр("Пользователь", Пользователь);
	Запр.УстановитьПараметр("Номенклатура", Номенклатура);
	Запр.Текст = "ВЫБРАТЬ
	             |	МАКСИМУМ(БуферСканирования.Счетчик) КАК Счетчик
	             |ИЗ
	             |	РегистрСведений.БуферСканирования КАК БуферСканирования
	             |ГДЕ
	             |	БуферСканирования.Пользователь = &Пользователь
	             |	И БуферСканирования.Номенклатура = &Номенклатура";
	Выборка = Запр.Выполнить().Выбрать();
	Выборка.Следующий();
	Счетчик = Выборка.Счетчик;

КонецПроцедуры

&НаКлиенте
Процедура ПеренестиВДокумент(Команда)
	
	Если ЗначениеЗаполнено(ДокументОснование) Тогда
		ПеренестиВДокументНаСервере();
		ОповеститьОбИзменении(ДокументОснование);
		КомандаОбновить(Неопределено);
		Оповестить("ПеречитатьДанныеФормыДокумента",,ЭтаФорма);
	Иначе	
		клОшибка(НСтр("ru = 'Не выбран документ-основание!'; en = 'The base document has not been selected!'"));	
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПеренестиВДокументНаСервере()
	
	Запр = Новый Запрос;
	Запр.Текст = "ВЫБРАТЬ
	             |	ПриходнаяНакладнаяТовары.Серия КАК Серия
	             |ИЗ
	             |	Документ.ПриходнаяНакладная.Товары КАК ПриходнаяНакладнаяТовары
	             |ГДЕ
	             |	ПриходнаяНакладнаяТовары.Серия <> """"
	             |	И ПриходнаяНакладнаяТовары.Ссылка = &Ссылка"; 
	Если ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.РасходнаяНакладная") Тогда	
		Запр.Текст = СтрЗаменить(Запр.Текст, "ПриходнаяНакладная", "РасходнаяНакладная");
	КонецЕсли;	
	Запр.УстановитьПараметр("Ссылка", ДокументОснование);
	МасСерии = Запр.Выполнить().Выгрузить().ВыгрузитьКолонку(0);
	
	ДокОбъект = ДокументОснование.ПолучитьОбъект();
	Ошибки.Очистить();
	Запр = Новый Запрос; 
	Запр.УстановитьПараметр("ДокументОснование", 	ДокументОснование);
	Запр.УстановитьПараметр("Пользователь", 		Пользователь);
	Запр.Текст = "ВЫБРАТЬ
	             |	БуферСканирования.Номенклатура,
	             |	БуферСканирования.Серия
	             |ИЗ
	             |	РегистрСведений.БуферСканирования КАК БуферСканирования
	             |ГДЕ
	             |	БуферСканирования.ДокументОснование = &ДокументОснование
	             |	И БуферСканирования.Пользователь = &Пользователь
	             |
	             |УПОРЯДОЧИТЬ ПО
	             |	БуферСканирования.Счетчик";
	Выборка = Запр.Выполнить().Выбрать();

	Если ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.ПриходнаяНакладная") Тогда
		
		НачатьТранзакцию();
		Пока Выборка.Следующий() Цикл
			СерияЗаполнена = Ложь;
			Для каждого СтрокаТЧ Из ДокОбъект.Товары Цикл 
				Если СтрокаТЧ.Серия = "" И Выборка.Номенклатура = СтрокаТЧ.Номенклатура Тогда 
					Если МасСерии.Найти(Выборка.Серия) = Неопределено Тогда
						СтрокаТЧ.Серия = Выборка.Серия; 
						СтрокаТЧ.Партия = НоваяПартия(ДокументОснование, Выборка.Номенклатура, СтрокаТЧ.ЦенаЗакупки, Выборка.Серия, СтрокаТЧ.ВКД_ЦенаСоСкидкой);
						СерияЗаполнена = Истина; 
						МасСерии.Добавить(Выборка.Серия);
						Прервать;  
					Иначе
					Ошибки.Добавить(СтрШаблон("%1 %2 (%3) %4", 
											НСтр("ru = 'Серия'; en = 'Series'"),
											Выборка.Серия, 
											Выборка.Номенклатура,
											НСтр("ru = 'уже есть в документе'; en = 'is already in the document'")) 
									);
					КонецЕсли;
				КонецЕсли;
			КонецЦикла;	
			Если НЕ СерияЗаполнена Тогда
				Ошибки.Добавить(СтрШаблон("%1 %2 %3 %4", 
											НСтр("ru = 'Не удалось перенести серию'; en = 'Failed to transfer series'"),
											Выборка.Серия,
											НСтр("ru = 'номенклатуры'; en = 'of good'"),
											Выборка.Номенклатура) 
								);
			КонецЕсли;
		КонецЦикла;

	ИначеЕсли ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.РасходнаяНакладная") Тогда
		
		НачатьТранзакцию();
		Пока Выборка.Следующий() Цикл 
			
			СерияЗаполнена = Ложь;
			СпиПар = омСервер.ПартииПоСерииОстатки(Выборка.Серия, ДокументОснование.Фирма, ДокументОснование.Склад);
			Ско = СпиПар.Количество();
			ТекПар = 0;
			Если Ско = 0 Тогда
				Ошибки.Добавить(СтрШаблон(НСтр("ru = 'Нет остатков по серии: %1!'; en = 'There are no remaining goods for the series: %1!'"), Выборка.Серия));
				Продолжить;
			ИначеЕсли Ско > 1 Тогда
				//	Эле = СпиПар.ВыбратьЭлемент(НСтр("ru = 'Найдено несколько партий с такой серией, выберите:'; en = 'Several batches with this series have been found, please select:'"));
				//	Если Эле = Неопределено Тогда Возврат КонецЕсли;
				//	ТекПар = Эле.Значение;
			Иначе
				ТекПар = СпиПар[0].Значение;
			КонецЕсли; 

			Если НЕ СерияЗаполнена Тогда
				Ошибки.Добавить(СтрШаблон("%1 %2 %3 %4", 
										НСтр("ru = 'Не удалось перенести серию'; en = 'Failed to move series'"),
										Выборка.Серия,
										НСтр("ru = 'номенклатуры'; en = 'of the good'"),
										Выборка.Номенклатура));
			КонецЕсли; 
			
		КонецЦикла;

	Иначе
		Возврат;
	КонецЕсли;	

	Если Ошибки.Количество() = 0 Тогда
	    ДокОбъект.Записать();  
		Набор = РегистрыСведений.БуферСканирования.СоздатьНаборЗаписей();
		Набор.Отбор.Пользователь.Установить(Пользователь);
		Набор.Отбор.ДокументОснование.Установить(ДокументОснование);
        Набор.Записать();
		ЗафиксироватьТранзакцию();
	Иначе	
		ОтменитьТранзакцию();
		Для каждого Ош Из Ошибки Цикл
		    Сообщить(Ош.Значение);
		КонецЦикла;
	КонецЕсли;

КонецПроцедуры

&НаСервереБезКонтекста
Функция НоваяПартия(Ссылка, НовНом, НовЦен, НовСер = "", ЦенаСоСкидкой)
	
	Спр = Справочники.Партии.СоздатьЭлемент();
	
	Спр.Владелец 			= НовНом;
	Спр.Док 				= Ссылка;
	Спр.Наименование 		= "ПН_" + Лев(гоМгновение(Ссылка.Дата), 8);
	Спр.Контрагент 			= Ссылка.Контрагент;
	Спр.ЦенаЗакупки 		= НовЦен;
	Спр.Валюта 				= Ссылка.Валюта;
	Спр.ДатаПартии 			= Ссылка.Дата;
	Спр.Фирма 				= Ссылка.Фирма;
	Спр.Серия 				= НовСер;
	Спр.ВКД_ЦенаСоСкидкой 	= ЦенаСоСкидкой;
	
	Спр.Записать();
	
	Возврат Спр.Ссылка;
	
КонецФункции

#КонецОбласти


#Область Команды
	
&НаКлиенте
Процедура КомандаОбновить(Команда)

	Элементы.БуферНоменклатура.Обновить();
	Элементы.БуферСерии.Обновить();

КонецПроцедуры

&НаКлиенте
Процедура КтоЕщеСканирует(Команда)  
	
	//клПредупреждение(КтоЕщеСканируетНаСервере(),,НСтр("ru = 'Буфер сканирования'; en = 'Scan buffer'")); 
	клПредупреждение(КтоЕщеСканируетНаСервере(),,ЭтаФорма.Заголовок); 
	
КонецПроцедуры

&НаСервере
Функция КтоЕщеСканируетНаСервере()
	
	Стр = "";
	Запр = Новый Запрос;
	//Запр.УстановитьПараметр("Пользователь", гоПользователь());
	Запр.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	             |	БуферСканирования.ДокументОснование КАК ДокументОснование,
	             |	БуферСканирования.ДокументОснование.Контрагент КАК Контрагент,
	             |	БуферСканирования.Пользователь КАК Пользователь
	             |ИЗ
	             |	РегистрСведений.БуферСканирования КАК БуферСканирования
	             //|ГДЕ
	             //|	БуферСканирования.Пользователь <> &Пользователь
	             |
	             |УПОРЯДОЧИТЬ ПО
	             |	Пользователь";
	Выборка = Запр.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		Стр = СтрШаблон("%1%2: %3 (%4)%5",
						Стр,
						Выборка.Пользователь,
						ОбщегоНазначения.ПредставлениеДокументаДляПечати(Выборка.ДокументОснование),
						Выборка.Контрагент,
						Символы.ПС);
	КонецЦикла;	
	Возврат ?(Стр = "", НСтр("ru = 'Другие пользователи буфер сканирования не используют'; en = 'Other users do not use the scan buffer'"), Стр);
	
КонецФункции

&НаКлиенте
Процедура УдалитьВсе(Команда)
	
	клДаНет(Новый ОписаниеОповещения("УдалитьВсеЗавершение", ЭтотОбъект), НСтр("ru = 'Удалить все строки?'; en = 'Delete all lines?'"));
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьВсеЗавершение(Результат, ДополнительныеПараметры) Экспорт
	Если Результат Тогда
		УдалитьВсеНаСервере();	
	КонецЕсли;  
	Элементы.БуферСерии.Обновить();
КонецПроцедуры

&НаСервере
Процедура УдалитьВсеНаСервере()

	Набор = РегистрыСведений.БуферСканирования.СоздатьНаборЗаписей();
	Набор.Отбор.ДокументОснование.Установить(ДокументОснование);
	Набор.Отбор.Пользователь.Установить(Пользователь);
	Набор.Записать();
	
КонецПроцедуры

&НаКлиенте
Процедура ВставитьИзБуфера(Команда)
	
	Буф = РаботаСоСканеромШК.ПолучитьИМЕИИзБуфера();
	
	КвоСтрок = СтрЧислоСтрок(Буф);
	Для Н = 1 По КвоСтрок Цикл
		НовСер = "";
		С = СтрПолучитьСтроку(Буф, Н);
		Пока (НовСер = "") И (С <> "") Цикл
			НовСер = гоСледПолеТаб(С);
		КонецЦикла;	
		серия = СокрЛП(НовСер);
		Если серия = "" Тогда
			Продолжить;		
		Иначе
			ДобавитьСерию(серия)
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьБуфер(Команда)
	
	ОткрытьФорму("Обработка.БуферСканирования.Форма.ФормаОчистки", , ЭтотОбъект);
	
КонецПроцедуры
 
#КонецОбласти
